Tests:
1. Manually set up EN, use terraform to create SCC with EN connection:
![image](https://github.com/user-attachments/assets/7fb9e777-ece1-4b76-a618-00a59cd8fd34)
first apply:
```hcl
  # module.create_scc_instance.ibm_iam_authorization_policy.en_s2s_policy[0] will be created
  + resource "ibm_iam_authorization_policy" "en_s2s_policy" {
      + id                          = (known after apply)
      + roles                       = [
          + "Event Source Manager",
        ]
      + source_resource_group_id    = (known after apply)
      + source_resource_instance_id = (known after apply)
      + source_resource_type        = (known after apply)
      + source_service_account      = (known after apply)
      + source_service_name         = "compliance"
      + target_resource_group_id    = (known after apply)
      + target_resource_instance_id = "crn:v1:bluemix:public:event-notifications:eu-gb:a/abac0df06b644a9cabc6e44f55b3880e:17e268f8-2180-4a09-b9d4-ad82ed08a4da::"
      + target_resource_type        = (known after apply)
      + target_service_name         = "event-notifications"
      + transaction_id              = (known after apply)
      + version                     = (known after apply)

      + resource_attributes (known after apply)

      + subject_attributes (known after apply)
    }
```
Changed EN source name, then second apply:
```hcl
  # module.create_scc_instance.ibm_scc_instance_settings.scc_instance_settings[0] will be created
  + resource "ibm_scc_instance_settings" "scc_instance_settings" {
      + id          = (known after apply)
      + instance_id = "bea500a0-7e2f-4e7c-9f10-a2460abbdf8e"

      + event_notifications {
          + instance_crn       = "crn:v1:bluemix:public:event-notifications:eu-gb:a/abac0df06b644a9cabc6e44f55b3880e:17e268f8-2180-4a09-b9d4-ad82ed08a4da::"
          + source_description = (known after apply)
          + source_id          = (known after apply)
          + source_name        = "ks-test-scc"
          + updated_on         = (known after apply)
        }

      + object_storage {
          + bucket          = "scc-cb"
          + bucket_endpoint = (known after apply)
          + bucket_location = (known after apply)
          + instance_crn    = "crn:v1:bluemix:public:cloud-object-storage:global:a/abac0df06b644a9cabc6e44f55b3880e:875f1955-2117-46b7-9b44-b0adffe64651::"
          + updated_on      = (known after apply)
        }
    }
```
I did notice the source name in the policy did not update. Not sure if that is an issue or not.

